<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"web1/production","backend":"fc5d6d2d658683e1699909ed618bdac6852ef2f5f023c2fdea87b149ff4a40eb","plan_job_ref":"Job Generate OpenTofu Plan #111 at https://github.com/alexdragongc/test-vercel-backend-hello-world-iac/actions/runs/22149222574","plan_out_hash":"96202eff5bb6073801405450d15ab88b924767de8c3d492713deefeb46e9bb6c","plan_hash":"3730f72ad3c42cd7636735b50971188a0bf5d931dd2927e18ca625ea12c5669b","plan_text_format":"diff","version":"2.2.3","closed":true} -->
OpenTofu plan for __web1/production__
<details>
<summary>Plan: 0 to add, 1 to change, 0 to destroy.</summary>

```diff
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place (current -> planned)

OpenTofu will perform the following actions:

  # vercel_project.my_project will be updated in-place
!~  resource "vercel_project" "my_project" {
+       build_machine_type                                = (known after apply)
+       enable_preview_feedback                           = (known after apply)
+       git_provider_options                              = (known after apply)
!~      git_repository                                    = {
!~          repo              = "alexangc/test-vercel-backend-hello-world-iac" -> "alexdragongc/test-vercel-backend-hello-world-iac"
#            (2 unchanged attributes hidden)
        }
        id                                                = "prj_LNiPwjtv3VyAzq23rCnWH0t10MCi"
        name                                              = "web1"
+       preview_comments                                  = (known after apply)
+       protection_bypass_for_automation_secret           = (sensitive value)
!~      resource_config                                   = {
+           function_default_cpu_type = (known after apply)
+           function_default_timeout  = (known after apply)
#            (2 unchanged attributes hidden)
        }
!~      serverless_function_region                        = "iad1" -> (known after apply)
+       team_id                                           = (known after apply)
#        (18 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```
</details>

:x: Error applying plan in [Apply OpenTofu Plan #64](https://github.com/alexdragongc/test-vercel-backend-hello-world-iac/actions/runs/22149254656)